
public class J230523_06_WhileGuGuDan {

	public static void main(String[] args) {
		int i = 2; //앞에것
		while(i <=9) {
			int j =1; //뒤에것 !!!!  꼭 while문 안쪽에서 선언해야돼
						//int j = 1;을 while문 바깥에 선언한다면, j는 해당 while문의 바깥에서도 유효한 변수가 되어 다른 코드에서도 접근할 수 있게 됩니다. 
						//그러나 이 경우, while문의 내부에서 j 값을 조작하면서 원하지 않는 동작이 발생할 수 있습니다.
			while(j <= 9) {
				
				System.out.printf("%d  * %d = %2d\t  ", i, j,i*j);
				++j;
			}
			++i;
			System.out.println();			
		}
		System.out.println();
		System.out.println();
		

		System.out.println("quizㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ");
		System.out.println();
		
		i = 1;
		while(i <=9) {
			int j = 2;
			while(j <=9) {
				System.out.printf("%d * %d = %d \t",j , i ,i * j);
				j++;
			}
			System.out.println();
			i++;
		}
		/*
		 <<Quiz>>
		2*1=2  3*1=3  4*1=4  5*1=5  6*1=6  7*1=7  8*1=8  9*1=9
		2*2=4  3*2=6  4*2=8  5*2=10 6*2=12 7*2=14 8*2=16 9*2=18
		2*3=6  3*3=9  4*3=12 5*3=15 6*3=18 7*3=21 8*3=24 9*3=27
		2*4=8  3*4=12 4*4=16 5*4=20 6*4=24 7*4=28 8*4=32 9*4=36
		2*5=10 3*5=15 4*5=20 5*5=25 6*5=35 7*5=35 8*5=40 9*5=45
		2*6=12 3*6=18 4*6=24 5*6=30 6*6=36 7*6=42 8*6=48 9*6=54
		2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49 8*7=56 9*7=63
		2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64 9*8=72
		2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81 
		 */
		
		
	}// main메서드 끝

} //클래스 끝
